constant/parcelInjectionProperties_C3H8
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      parcelInjectionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//    (x y z)   (u v w)   d   rho   mDot  T  Cp   (Y0..Y2) (Yg0..YgN) (Yl0..YlN) (Ys0..YsN)
(
    (1 0.5 0.5) (-5 0 0) 0.001 1000 0.002 300 4200 (0 0 1) () (0 1) ()
    (1 0.6 0.5) (-5 0 0) 0.001 1000 0.002 300 4200 (0 0 1) () (0 1) ()
    (1 0.5 0.6) (-5 0 0) 0.001 1000 0.002 300 4200 (0 0 1) () (0 1) ()
    (1 0.4 0.5) (-5 0 0) 0.001 1000 0.002 300 4200 (0 0 1) () (0 1) ()
    (1 0.5 0.4) (-5 0 0) 0.001 1000 0.002 300 4200 (0 0 1) () (0 1) ()
);


// ************************************************************************* //