constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         false;
    transient       yes;
    cellValueSourceCorrection off;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            h               explicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               Euler;
    }
}


constantProperties
{
    rho0            1000;
    T0              293;
    Cp0             4100;

    volumeUpdateMethod  constantRho;
}


subModels
{
    particleForces
    {
        sphereDrag;
    }

    injectionModels
    {

        model1
        {
            type                reactingMultiphaseLookupTableInjection;
            massTotal           0.0001;
            parcelBasisType     mass;
            SOI                 0;

            inputFile           "parcelInjectionProperties_H2O";
            duration            3.0;
            parcelsPerSecond    2000;
            randomise           true;
        }
        model2
        {
            type                reactingMultiphaseLookupTableInjection;
            massTotal           0.0001;
            parcelBasisType     mass;
            SOI                 0;

            inputFile           "parcelInjectionProperties_C3H8";
            duration            3.0;
            parcelsPerSecond    2000;
            randomise           true;
        }
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel none;

    compositionModel singleMixtureFraction;

    phaseChangeModel none;

    devolatilisationModel none;

    surfaceReactionModel none;

    stochasticCollisionModel none;

    surfaceFilmModel none;

    radiation       off;

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas
            {
            }
            liquid
            {
                H2O  0.5;
                C3H8 0.5;
            }
            solid
            {
            }
        );
        YGasTot0        0;
        YLiquidTot0     1;
        YSolidTot0      0;
    }
}


cloudFunctions
{}


// ************************************************************************* //
